
&НаСервереБезКонтекста
Процедура ВыполнитьПервоначальноеЗаполнение()

	// создадим категории 4 и 5, т.к. они иногда встречаются на соревнованиях 
	КатегорияТрассы = Справочники.КатегорииТрасс.СоздатьЭлемент();
	КатегорияТрассы.Наименование = "4";
	КатегорияТрассы.Записать();
	
	КатегорияТрассы = Справочники.КатегорииТрасс.СоздатьЭлемент();
	КатегорияТрассы.Наименование = "5";
	КатегорияТрассы.Записать();
	
	// заполним справочник категориями от 5 до 9 с буквами и плюсами
	БуквыКатегорий = Новый Массив;
	БуквыКатегорий.Добавить("A");
	БуквыКатегорий.Добавить("B");
	БуквыКатегорий.Добавить("C");
	
	Для НомерКатегории = 5 По 9 Цикл
		
		Для каждого БукваКатегории Из БуквыКатегорий Цикл
			
			КатегорияТрассы = Справочники.КатегорииТрасс.СоздатьЭлемент();
			КатегорияТрассы.Наименование = Строка(НомерКатегории) + БукваКатегории;
			КатегорияТрассы.Записать();
			
			КатегорияТрассы = Справочники.КатегорииТрасс.СоздатьЭлемент();
			КатегорияТрассы.Наименование = Строка(НомерКатегории) + БукваКатегории + "+";
			КатегорияТрассы.Записать();
		
		КонецЦикла;
		
	КонецЦикла;
	
	Сообщить("Выполнение обработки завершено");
	
КонецПроцедуры // ВыполнитьПервоначальноеЗаполнение

&НаКлиенте
Процедура КомандаПервоначальноеЗаполнение(Команда)
	
	ВыполнитьПервоначальноеЗаполнение();
	
	ОповеститьОбИзменении(ПредопределенноеЗначение("Справочник.КатегорииТрасс.ПустаяСсылка"));

КонецПроцедуры
